<img src= 'hanuman.jpg'>

In [2]:
import pandas as pd
import numpy as np

In [6]:
ser= [4,5,8,9,5]
a=pd.Series(ser)
a

0    4
1    5
2    8
3    9
4    5
dtype: int64

In [7]:
type(a)

pandas.core.series.Series

In [9]:
ser= pd.Series(np.random.randint(12,30,10))
ser

0    15
1    19
2    21
3    23
4    20
5    23
6    20
7    24
8    27
9    29
dtype: int32

In [10]:
ser.head()

0    15
1    19
2    21
3    23
4    20
dtype: int32

In [11]:
ser.head(7)

0    15
1    19
2    21
3    23
4    20
5    23
6    20
dtype: int32

In [12]:
ser.tail()

5    23
6    20
7    24
8    27
9    29
dtype: int32

In [13]:
ser.tail(6)

4    20
5    23
6    20
7    24
8    27
9    29
dtype: int32

In [14]:
ser= pd.Series(np.random.randint(12,30,200))
ser

0      26
1      14
2      27
3      27
4      17
       ..
195    12
196    14
197    23
198    25
199    15
Length: 200, dtype: int32

In [15]:
ser.index

RangeIndex(start=0, stop=200, step=1)

In [17]:
ser.dtype

dtype('int32')

In [21]:
ser2= pd.Series(ser,dtype='object')
ser2

0      26
1      14
2      27
3      27
4      17
       ..
195    12
196    14
197    23
198    25
199    15
Length: 200, dtype: object

In [22]:
ser= {'college':['ALD','KNP','PATNA']}
c= pd.Series(ser)
c

college    [ALD, KNP, PATNA]
dtype: object

In [23]:
type(c)

pandas.core.series.Series

In [27]:
ser3=[1,2,3,4,5]
ser3
d= pd.Series(ser3,index=['a','b','c','d','e'])
d

a    1
b    2
c    3
d    4
e    5
dtype: int64

# DATAFRAME

In [29]:
X= [4,5,6,7,8,9]
Y= pd.DataFrame(X)
Y

   0
0  4
1  5
2  6
3  7
4  8
5  9

In [31]:
type(Y)

pandas.core.frame.DataFrame

In [34]:
x={'nsti':['ald','knp','patna','jammu','kanpur'],'num':[4,5,6,7,8]}
y= pd.DataFrame(x,index=[4,5,6,7,8])
y

     nsti  num
4     ald    4
5     knp    5
6   patna    6
7   jammu    7
8  kanpur    8

In [37]:
x['num']

[4, 5, 6, 7, 8]

In [36]:
y.shape

(5, 2)

In [38]:
y.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 4 to 8
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nsti    5 non-null      object
 1   num     5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 120.0+ bytes

In [40]:
y.describe()

            num
count  5.000000
mean   6.000000
std    1.581139
min    4.000000
25%    5.000000
50%    6.000000
75%    7.000000
max    8.000000

In [44]:
y.to_csv('pandas.csv')

In [ ]:
y.to_excel('h.xlsx')

In [47]:
pd.read_csv('pandas.csv')

   Unnamed: 0    nsti  num
0           4     ald    4
1           5     knp    5
2           6   patna    6
3           7   jammu    7
4           8  kanpur    8

In [51]:
b=y.duplicated()
b

4    False
5    False
6    False
7    False
8    False
dtype: bool

In [52]:
c= y.dropna()
c

     nsti  num
4     ald    4
5     knp    5
6   patna    6
7   jammu    7
8  kanpur    8